Revit 2027 API
PanelScheduleTemplate.GetTableData Method
 Gets the writable table data object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PanelScheduleData GetTableData()
Public Function GetTableData As PanelScheduleData
public:
PanelScheduleData^ GetTableData()
member GetTableData : unit -> PanelScheduleData
Return Value
PanelScheduleData
 The panel schedule data object.
Remarks
 Access to this information requires an open transaction.
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace